# Python module

**先移步阅读基本的、低质量的关于 [python module 的简介](https://github.com/luanxxys/computer_science/blob/master/data_mining/Python%20module.md)**

### Reference

- [module detail](visualization.md)
> 未整理完成,以后再根据这些,"以图示人"

### 首先简单区分几个数据处理的库

- Numpy

        矩阵操作；元素类型要相同

- Scipy

        基于 Numpy，科学计算库，有一些高阶抽象和物理模型
        
- Pandas

        Numpy 的进一步封装；以 DataFrame 为基本处理结构

### numpy

- 创建向量,矩阵

In [38]:
import numpy as np

vector = np.array([1, 3])
matrix = np.arange(4).reshape(2, 2)

- 查看结构

In [39]:
matrix.shape

(2, 2)

- 类型转换

In [40]:
print(vector)
print(vector.astype(float))

[1 3]
[1. 3.]

### pandas
> 以 Titanic 训练集为例

- pandas 读取以 , 分割的文件(包括 csv 文件)

In [41]:
import pandas as pd
f = pd.read_csv("train.csv")

- 查看数据信息(前三个样本)

In [42]:
f.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

- 取 3-5 样本数据

In [43]:
f.loc[3:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

- 统计特征相互关系

In [44]:
re = f.pivot_table(index="Pclass",values=["Survived","Fare"],aggfunc=np.mean)
re

             Fare  Survived
Pclass
1       84.154687  0.629630
2       20.662183  0.472826
3       13.675550  0.242363

- 去掉某行/列

In [45]:
f.dropna(axis=0,subset=["Age","Sex"]).head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S